Capstone/Meetings.tex
% Created 2024-02-18 Sun 19:32
% Intended LaTeX compiler: pdflatex
\documentclass[a4paper, 10pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[margin=1in]{geometry}
\usepackage{amsmath,amsthm,amssymb,tensor,physics}
\usepackage{setspace,multicol,tasks}
\usepackage[shortlabels]{enumitem}
\usepackage{fancyhdr}
\usepackage{graphicx,hyperref}
\setcounter{secnumdepth}{0}
\author{Scribe: Jalen Moore}
\date{\today}
\title{Team 5 - Capstone Meeting Notes}
\hypersetup{
 pdfauthor={Scribe: Jalen Moore},
 pdftitle={Team 5 - Capstone Meeting Notes},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.2 (Org mode 9.7-pre)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{In-Class Worktime (February 15th)}
\label{sec:orgbcbce95}

\begin{center}
\begin{tabular}{ll}
Location & Zoom\\
Attendees & Team\\
\end{tabular}
\end{center}

\begin{itemize}
\item Discussed with Dr. Siy on the VMWare server.
\item Worked on and completed the goals, functional requirements, and wireframe initial requirements. Coordinated with Kaleb for the video recordings discussing the Goals and Wireframe.
\end{itemize}
\section{Sponsor Meeting (February 14th, 14:00)}
\label{sec:orge2d7369}

\begin{center}
\begin{tabular}{ll}
Location & Zoom\\
Attendees & Mike Schmitt, Karthik Reddy Pagilla, Team\\
\end{tabular}
\end{center}

\begin{itemize}
\item Will resend Dropbox immediately after meeting.
\item Can test with the APK on android, but not all the Python may work.
\item Open to creating repo branches. Feel free to experiment.
\item Again, they are open to anything. If it costs money they are open with good reason.
\item Karthik will run through code next time.
\item There may be some un-used code. This can be checked by monitoring the routes when debugging.
\end{itemize}
\section{In-Class Worktime (February 13th)}
\label{sec:org39c2975}

\begin{center}
\begin{tabular}{ll}
Location & Zoom\\
Attendees & Team\\
\end{tabular}
\end{center}

\begin{itemize}
\item Discussed working on Initial Requirements 1-3 and when to record the presentations for the goals and wireframes.
\item Discussed/analyzed code an determined topics of discussion for tomorrow's sponsor meeting:
\begin{enumerate}
\item Get an example of the JSON used in the Python scripts.
\item Get a walkthrough of the Python code.
\item Ask about AWS server.
\item Get a proper link to the dropbox Mike referenced in an email.
\end{enumerate}

\item \texttt{findHomography()}: \url{https://docs.opencv.org/4.x/d9/d0c/group\_\_calib3d.html\#ga4abc2ece9fab9398f2e560d53c8c9780}
\end{itemize}
\section{Sponsor Meeting (February 2nd, 12:30)}
\label{sec:org7469f08}

\begin{center}
\begin{tabular}{ll}
Location & Zoom\\
Attendees & Tom Thompson, Mike Schmitt, Karthik Reddy Pagilla, Team\\
\end{tabular}
\end{center}

\textbf{Origins:}
\begin{itemize}
\item Started when Tom bought a house. Had french pane windows. 15\$/hour for 4 hours just to mask his windows. Thought there was a better way.
\item Using crack and peel paper. 8 seconds to cover versus 2.5 minutes.
\end{itemize}

\textbf{Project:}
\begin{itemize}
\item Not starting from scratch, although the method of measuring is open for changing (from OpenCV).
\item Priorities (in order): algorithm for measuring, integration/UI, payment processing.
\item Aim for at least 1/16 accuracy in measurements.
\item Focused on interior painting. Straight on photos, not much of an angle to these photos. Potential for more dramatic photos, but not in our project scope.
\item Karthik is our tech guy. Angular/Ionic. NodeJS server backend. OpenCV libraries. Checker board object as reference to calculate window size. Cannot nail down exact precision of window size. We want it precise. UI and image processing is not where we want to be. Currently have login, create windows, photo.
\end{itemize}

\textbf{Next steps:}
\begin{itemize}
\item Share github accounts and get a Teams chat going.
\item Browse through the code and determine our technical next steps.
\item Establish a weekly meeting. Karthik is available MTW after lunch and F after 2:30.
\end{itemize}
\end{document}
